Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Webcomic_Star Chasing Boys (KO>EN).tmx
Source language: ko
Languages: en

source: 어제 일로 우리 컴백 무대는 아예 화제도 못 될 것 같으니
en: no one will even care about our comeback performance because of the incident last night.

source: ...저...{j}감독님 한 번만 다시 해보면 안될까요?
en: ummm... sir, can we please have another chance?{j}

source: 설마 우리한테도 저러는 건...
en: he’s not going to kill us too, is he...?

source: 모두를 구원할 근원이란다.
en: ...for you and everyone else.

source: 타호 찾았...
en: found taho--

source: 그게 무슨..원래 일하던 형은 어쩌고···!
en: what about... our former manager?

source: 그냥 꿈...{j}이지?
en: it was just... a dream, right?{j}

source: 으악!!
en: ack!!

source: 으 아 악 !!
en: arghhh!!

source: 신기해요
en: So cool

source: 어차피 무대에 오르면 마법 써야 되잖아.
en: we have to use magic for our performances anyway.

source: 매니저 형도 다쳤잖아요, 손.{j}아까 봤어요.
en: I know you hurt your hand too, dk. I saw it earlier.{j}

source: 혹시 이번 일 너랑 관련 있어?
en: did what happened have anything to do with you?

source: 우리 무대 멋지게 보여 주자!
en: let’s show him how awesome we are!

source: 괜찮긴 한데...
en: I’m okay but...

source: 조식은 한식?{j}양식?{j}어느 쪽이 좋으십니까?
en: “would you prefer a korean breakfast or a continental breakfast?”{j}{j}

source: 그로 인해 마법 능력자들이 나타나기 시작했죠.
en: as a result, the world started to see people with magical abilities.

source: 파아
en: flicker

source: 다행이다.{j}반응도 꽤 좋은 거 같아.
en: I’m happy for him. it looks like he’s getting a lot of positive response, too.{j}

source: 이후 병원으로 이송하도록 협조…
en: could you then help us bring him to the hospital-?

source: 통증의 잔재가 남아 분명 괴로우실 겁니다.
en: you must be in pain due to the lingering effects.

source: 많이 아파?
en: does it hurt a lot?

source: 열심히 하겠습니다.
en: we’ll do our best.

source: 챙-
en: clang

source: 잘못되면 유진 형이 다칠 수도 있어.
en: eugene could get hurt if things go wrong.

source: 자라는 동안에도
en: ...throughout your childhood...

source: ..아까 그건 대체 뭐였지..?
en: what was that earlier...?

source: 얼른 가자
en: let’s hurry

source: 아직 아무것도 못 받았거든요?
en: ...but we haven’t gotten anything yet.

source: 어머니!
en: mother!

source: 이게 무슨...
en: I don’t get it--

source: 그러니까 더 노력하자 할 수 있었는데
en: that’s how I’ve been motivating the members.

source: 많이 힘들었지?
en: I know, we had a long day.

source: 솔직히 말해준다며?
en: you said you don’t want to keep secrets anymore?

source: ...형
en: eugene...

source: 어..{j}어떻게 된...
en: what... just happened...?{j}

source: 나랑 비켄 형이랑 동물병원 다녀올게.
en: viken and I will take the cat to the vet.

source: 왜지?!!
en: why’s this happening?!

source: 그렇군요.{j}정말 가능성이 많은 분들인 거 같습니다.
en: I see. I do think this group has great potential.{j}

source: 비켄 형도
en: ...and viken...

source: 콰드득
en: smash

source: 그, 그럼 우리가 형한테 마법을 배우면..
en: t-then if we learn magic from you--

source: ...아까 그건 대체 뭐였지...?
en: what was that earlier...?

source: 응.{j}머리 좀 제대로 말리고 누울게 먼저 자, 형
en: I will, just after I dry my hair. good night, soule.{j}

source: 이 세계에 왜 마법이 나타났을까?{j}생각해 보신 적 있으십니까?
en: have you ever wondered why magic appeared in this world?{j}

source: 눈앞에서 타호가 아파하는 걸 뻔히 보면서도
en: but now, the first thought that came to mind...

source: 저~기 저거 매직 아일랜드 아니야?{j}뚝섬 근처인가?
en: isn’t that the magic island over there? then... are we near ttukseom island?{j}

source: 왜 그러죠?
en: what’s the problem?

source: 저사람 대체 누구야?
en: who is that person?

source: 진짜..일까?
en: is that true?

source: 병원
en: Hospital

source: 예?!
en: what?!

source: cafee mellow
en: cafe mellow

source: 근원의 마법?
en: the origin?

source: 우리야, 우리...
en: it’s us.

source: 많은 사람들이 열광했습니다.{j}그리고 기대했죠.
en: ...and start a new chapter in history. the whole world was excited.{j}

source: 어깨 그렇게 다쳐서 안무는 어떻게 할 건데?
en: how do you plan to do all the dance moves with an injured shoulder?

source: 우와!
en: wow!

source: 운명의 소년들이라는 대마법사를 통해
en: that through the great wizards called the boys of destiny...

source: 꽉
en: clench

source: 이녀석들..{j}분위기가 바뀌었다?!
en: something... about these brats changed!!{j}

source: 어릴 때 같은 아파트에서 살았고
en: no, we grew up in the same neighborhood...

source: 우린 마법도 못쓰는데 왜・・・!?
en: we can’t even use magic!

source: 한계가 있을 수밖에 없다는 것도 인정해.
en: I get that there are limits to what I can do.

source: 이룰 수 없는 유토피아가 아닙니까.
en: with magic that only a few people can use! sparingly, at that!

source: 비켜!!
en: move, taho!

source: 그건 아냐.
en: oh, not really.

source: 왜들 저래...?
en: what’s gotten into them...?

source: 우리 애들이라 하는 말이 아니라
en: I’m not just saying this because they’re from my agency.

source: 전에 얘기한 그 친구 연락 기다려?
en: are you waiting to hear back from that friend of yours?

source: 유진 형이 주워 온 그 고양이 맞지?
en: that’s the cat eugene found, right?

source: '간절함'이야.
en: ...a desperate heart.

source: 내가 마법을 잘하게 되면 네 친구 도와줄 수 있을지.
en: I might be able to help your friend if my magic gets better.

source: 너 같은 아이가 버티기 힘든 세계야.
en: ...have a hard time surviving in the entertainment business unless magic manifests.

source: 테러범들 공격을 피해서 빨리 찾으려면…
en: to find them quickly while dodging the terrorists’ attacks...

source: 맞아!{j}이 감촉!!
en: yeah! I remember this feeling!{j}

source: 인과율.
en: the causality.

source: 우와!{j}내가 진짜 하늘을 날고 있잖아!
en: wow! I’m actually flying!{j}

source: 형도 소문 들은 적 있지?
en: I’m sure you’ve heard about this too.

source: 응?{j}난 엄청 화려한 박스가 보이던데?
en: what? I saw an elaborate box.{j}

source: 쯧!
en: hmph!

source: 네.
en: hello?

source: 119 불러야지!
en: we should call 911!

source: 그 부작용으로 발작이 지속되면 온몸이 급격하게 얼어붙어서 죽을 수도 있는데
en: one of the side effects is seizure. if it persists, it can lead to a severe paralysis and even death.

source: 빡!
en: thwack

source: 다음 무대를 소개하겠습니다.
en: now onto the next performance.

source: 보여주지 않았습니까.
en: you have proved yourselves...

source: ….역시 예상대로구나
en: I knew it.

source: 아니...{j}별 거 아니야.
en: oh... it’s nothing!{j}

source: 깊은 연구를 통해 알아낸 것이라서 극소수의 사람들만이 알고 있습니다.
en: ...since the appearance of magic ten years ago know about it.

source: 그만해!!{j}하지 말라고!!
en: stop!! that’s enough!!{j}

source: 솔이에게 해를 끼친 그것을 몸 밖으로 끄집어 내는 걸
en: try to visualize in detail...

source: 그리고..
en: also...

source: 이거...
en: was this...

source: 절대 네 잘못 아니니까,
en: it’s really not your fault, so...

source: 그 사람 아냐?
en: do you think that’s him?

source: 이 사람… 어째서 테러범들이랑 똑같은 소릴 하지?!
en: he’s calling us by the same name as the terrorists did!!

source: 나라고!!
en: ...is right here!

source: 우리 멤버들한테도 빨리 가봐야 한다구요!
en: I need to go see the other members.

source: 일어나야 돼에~?
en: is it time to get up?

source: 우리의 인과율은 뭐지?
en: ...what is our causality?

source: 조용..
en: silence

source: 궁금하다.
en: I’m so curious.

source: 와~ 잘하시네요!!
en: Wow! You’re such a good singer!!

source: 제 6 화
en: Episode 6

source: 이상하네.
en: this is strange.

source: 1화 fin.
en: end of episode 1.

source: 파삿
en: leap

source: 피해!
en: run!

source: 넘어진데는 괜찮아?
en: are you hurt?

source: 본문듣기 · 설정
en: Listen to article · Settings

source: 제 18 화
en: Episode 18

source: 제 12 화
en: Episode 12

source: 호출이 있어 잠깐 사무실에 올라갔다 올 테니 10분 휴식.
en: I got a call from the office. I’ll be right back. you guys can take a ten-minute break.

source: 다행히 모두 무사히 깨어났군요.
en: I am glad all of you are awake.

source: 이거...{j}설마
en: no way...{j}

source: 아냐!{j}내가 갈게!{j}형은 안전한 곳으로 피해!
en: no, eugene! I will. you go hide somewhere safe.{j}{j}

source: 친구?{j}누구??
en: a friend? who??{j}

source: 타다닷
en: dash

source: 왜 과거형?
en: was?

source: 진짜 이름이요?
en: our true names?

source: 그나저나 얘 엄청 귀엽다.
en: that aside, this one's really adorable.

source: 아, 그리고 유진 형 안무에 맞추려면 솔이 형 방패 크기도 좀 키우면 좋을 거 같아.
en: to fit eugene’s range of motion.

source: 어떻게....
en: how...

source: 이게...
en: what...

source: 그게 진짜 마법서라면
en: ...and the spellbook is real...

source: 퍼억
en: wham

source: 이쪽으로 오세요!!{j}이쪽!!
en: everyone, come this way! over here!{j}

source: 이게 대체 뭐지?
en: but what are these?

source: 내 트레이닝을 받으면 너희들이 원하는 것을 얻을 수 있을 거다.
en: with my training, each of you will get what you wanted.

source: 왜!!!
en: why?

source: 아… 그건…
en: oh... about that...

source: 왜 네가 남들보다 몇 십 배는 강한 마법을 갖게 된 건지 알아?
en: do you know why you were given powers much stronger than other people’s?

source: 혀~엉!!
en: come on, avys!

source: 내가 한 거야?
en: was it me?

source: 이거 준비하느라 바빴구나.
en: he must’ve been busy working on this.

source: 왜 안 되는 거야!
en: why isn’t this working?

source: 아무 노력도 없이?
en: without the need for me to make more effort?

source: 예전의 공격과는 규모가 달라.
en: this attack is much stronger than the last one.

source: 잠깐 바람 좀 쐬고 올게
en: I’m going to get some fresh air.

source: 비켄 형에게 치유마법을 1회 빌려 사용한다.
en: I wish to borrow viken’s healing magic once.

source: 그 사람 아냐?{j}아이돌 테러한다는!
en: isn’t that the guy who terrorizes idols?!{j}

source: 하지만 집중력에 따라
en: but your level of concentration...

source: 하핫
en: haha

source: 싸아
en: glare

source: 연예계에 다방면으로 투자하는 큰 회사 대표래.
en: apparently, he’s a CEO at a large company that invests in the entertainment business.

source: 도대체 어떻게 된 거야?
en: what on earth happened, taho?!

source: 척-
en: reach

source: 네가 쉬는 만큼 무대 완성도가 떨어지겠지.{j}우리 사정도 여유롭진 않잖아.
en: you’ll still need to take time off, which means our performance will be less than ideal. we’re in no place to take risks, you know that.{j}

source: 타호야!{j}뭐해?{j}이제 집에 간대
en: taho! what are you doing? it’s time for us to go home.{j}

source: 조금만 참아!{j}안전한 곳으로 데려다줄게!!
en: hang in there! I’ll take you somewhere safe!{j}

source: 정작 위험할 때는 뭐 하다 이제 나타난 거지?
en: what were they doing all this time?

source: 녹차당
en: Green Tea House

source: 평소의 기세 넘치던 형 어디 갔어?{j}오랜만의 무대라 쫄았어?
en: where’s my enthusiastic, passionate eugene? are you scared about going on stage in a long time?{j}

source: 지금은 몸이 많이 안 좋아져서...
en: he got sick, so...

source: 괜찮아요?!!
en: are you okay?!

source: 팔락
en: flap

source: 두 분도 치료를 받으시죠.
en: you two should see a doctor as well.

source: 뭐하고 있어!
en: hide behind me!

source: 최종 리허설 끝냅니다!!
en: we’ll wrap up the rehearsal here.

source: 마력을 너무 많이 써버려서 더 이상 인과율을 버틸 수가 없다.
en: I’ve used too much magic that I can’t bear with the causality anymore...

source: 타호 찾았…
en: found taho--

source: 어딜!!
en: not on my watch!!

source: 콰아아
en: boom

source: 마법이 존재하는 세계에 살면서 이 정도에 놀라는 게 더 이상하지 않아?
en: you live in a world where magic exists, and this surprises you?

source: 10년 전…
en: ten years ago...

source: 우리한테 바라는 게 뭐죠?
en: what do you want from us?

source: 팍
en: slash

source: 너희들은 정말 아무것도 모르는구나.
en: you really have no idea, do you?

source: 내 눈으로 직접 확인해 봐야겠다
en: ...whether you deserve to have that power.

source: 너 뭐냐...?
en: wh-what are you...?

source: 언리미티드 부작용 환자거든.
en: he’s a patient with side effects of unlimited.

source: 멤버들도 같이 나갈 수는 없을까요?
en: can I do it with the other members?

source: 가능해.
en: you can.

source: 솔이 네가 기삿거리가 된다는 거지.
en: that shows you’re newsworthy, soule.

source: 슈우
en: swoosh

source: 아니요 저희는 정말 괜찮…
en: no, we’re really--

source: 새로운 치료법이 개발되기 전에 병들어 죽어가는 인류를 위해
en: ...or dying from illness before new treatment is developed...

source: 모두를 구하러!!
en: and rescue all of us!

source: 말도 안돼!
en: no way!

source: 대박!{j}솔이 형 개인 스케줄 잡혔나 보네
en: wow! soule must’ve gotten a solo gig!{j}

source: 으아악!
en: nooo!!

source: 3시간 전
en: 3 hours ago

source: 으아아...!
en: ahhh

source: 물 비린내・・・!
en: ew, the water smells fishy...!

source: 그 힘을 필요로 하는 곳이 있기 때문이야.
en: it’s because there are people who need that powers.

source: 빤-
en: stare

source: 타호야!
en: taho!

source: 야!!{j}그쪽이 아냐!
en: hey!! where you looking at?!{j}

source: 우, 우리 살아 있는 거야?
en: are- are we alive?

source: 롯님을 직접 뵙는 건 처음이군요.
en: it is a pleasure to meet you in person, ms. lote.

source: 환자 어디 있습니까?
en: where’s the patient?

source: 꽈악..
en: clench

source: 지금 쓰나 나중에 쓰나 큰 차이가 있겠어?
en: there shouldn’t be a huge different between using it now and later.

source: 컴백 무대 기대하겠습니다.{j}열심히 하세요.
en: I look forward to your comeback performance. good luck.{j}

source: 갑자기 팔찌가 생겼는데
en: I got bracelets around my wrists...

source: 솔이 형 방패 크기도 좀 키우면 좋을 거 같아.
en: to fit eugene’s range of motion.

source: 이 얼마나 만만한 세계인가…
en: what an easy world to live in...

source: 솔이만..
en: just soule?

source: 아무래도 여기서 이러고 있을 때가 아닌 거 같아.
en: I really don’t think we have time to rest like this.

source: 왜 그러냐고 사람 불편하게…
en: seriously, they make me so uncomfortable.

source: 형!!!{j}괜찮아?
en: soule!!! are you okay?{j}

source: 너희들의 무대를 공격했던 놈들이랑 난 아무 상관 없어.
en: no, I had nothing to do with the ones who attacked you on stage.

source: 잠깐 다녀오자.{j}나머지는 여기서 대기하고.
en: we’ll be right back. the rest of you, stay put.{j}

source: 어?!{j}뭐지??{j}갑자기 팔찌가 생겼는데
en: huh? what’s happening? I got these bracelets around my wrists...{j}

source: 형도 그렇지 않아?
en: what do you think?

source: 너까지 발현 된 거야?
en: ...even you manifested, too?

source: 더 자도 돼.
en: you can go back to sleep.

source: 그렇게 안자있다 죽고 싶지 않다면.
en: unless you want to die while sitting there.

source: 다들 무사한지!
en: check if they’re okay!

source: 그때까지 지낼 곳이 필요했는데 마침 너희들의 호의를 받았거든
en: I needed a place to stay until then. that’s when you offered me hospitality.
